import { Injectable } from '@angular/core';

type AdhyayName = {
  [key: number]: string;
};

@Injectable({
  providedIn: 'root'
})
export class DataService {

  constructor() { }

  adhyayName: AdhyayName = {
    1: "अध्याय पहिला - अर्जुनविषादयोग",
    2: "अध्याय दुसरा - सांख्ययोग",
    3: "अध्याय तिसरा - कर्मयोग",
    4: "अध्याय चौथा - ज्ञानकर्मसंन्यासयोग",
    5: "अध्याय पाचवा - कर्मसंन्यासयोग",
    6: "अध्याय सहावा - आत्मसंयमयोग",
    7: "अध्याय सातवा - ज्ञानविज्ञानयोग",
    8: "अध्याय आठवा - अक्षरब्रह्मयोग",
    9: "अध्याय नववा - राजविद्याराजगुह्ययोग",
    10: "अध्याय दहावा - विभूतियोग",
    11: "अध्याय अकरावा - विश्वरूपदर्शनयोग",
    12: "अध्याय बारावा - भक्तियोग",
    13: "अध्याय तेरावा - क्षेत्रक्षत्रज्ञविभागयोग",
    14: "अध्याय चौदावा - गुणत्रयविभागयोग",
    15: "अध्याय पंधरावा - पुरुषोत्तमयोग",
    16: "अध्याय सोळावा - दैवासुरसंपद्विभागयोग",
    17: "अध्याय सतरावा - श्रद्धात्रयविभागयोग",
    18: "अध्याय अठरावा - मोक्षसंन्यासयोग",
  }

  kandName: AdhyayName = {
    1: "बालकाण्ड",
    2: "अयोध्याकाण्ड",
    3: "अरण्यकाण्ड",
    4: "किष्किन्धाकाण्ड",
    5: "सुन्दरकाण्ड",
    6: "लंकाकाण्ड",
    7: "उत्तरकाण्ड "
  }
}
